Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 299, 299, 3) 0                                            
__________________________________________________________________________________________________
xception (Functional)           (None, 2048)         20861480    input_2[0][0]                    
__________________________________________________________________________________________________
flatten (Flatten)               (None, 2048)         0           xception[0][0]                   
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 2048)         8192        flatten[0][0]                    
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 2048)         8192        flatten[0][0]                    
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 2048)         0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
dropout (Dropout)               (None, 2048)         0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 64)           131072      dropout_2[0][0]                  
__________________________________________________________________________________________________
dense (Dense)                   (None, 64)           131072      dropout[0][0]                    
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 64)           256         dense_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 64)           256         dense[0][0]                      
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 64)           0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 64)           0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 16)           1024        dropout_3[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 16)           1024        dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 16)           64          dense_3[0][0]                    
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 16)           64          dense_1[0][0]                    
__________________________________________________________________________________________________
category_output (Dense)         (None, 5)            85          batch_normalization_9[0][0]      
__________________________________________________________________________________________________
sparkling_output (Dense)        (None, 1)            17          batch_normalization_6[0][0]      
__________________________________________________________________________________________________
floral_output (Dense)           (None, 1)            17          batch_normalization_6[0][0]      
__________________________________________________________________________________________________
striped_output (Dense)          (None, 1)            17          batch_normalization_6[0][0]      
==================================================================================================
Total params: 21,142,832
Trainable params: 272,840
Non-trainable params: 20,869,992
__________________________________________________________________________________________________